jimmywong2003/nrf5-modify-device-parameter-through-host/ble_app_change_advertising_example/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {TX_POWER_BUTTON, false, BUTTON_PULL, button_event_handler},
                {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        while(NRF_LOG_PROCESS());
        //UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void connect_advertising_start(void)
{
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void non_connect_advertising_start(void)
{
        ret_code_t err_code;

        err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
        APP_ERROR_CHECK(err_code);
}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;
        bool connect_mode_enter = false;

        /* enable instruction cache */
        NRF_NVMC->ICACHECNF = (NVMC_ICACHECNF_CACHEEN_Enabled << NVMC_ICACHECNF_CACHEEN_Pos) +
                              (NVMC_ICACHECNF_CACHEPROFEN_Disabled << NVMC_ICACHECNF_CACHEPROFEN_Pos);


        // Initialize.
        uart_init();
        log_init();
        timers_init();

        enter_button_init();

        connect_mode_enter       = connect_adv_enter_check();

//        buttons_leds_init(&erase_bonds);
        buttons_init();

        adc_configure();

        power_management_init();
        ble_stack_init();
        scheduler_init();

        application_timer_start();

        if (connect_mode_enter)
        {
                gap_params_init();
                gatt_init();
                services_init();
                connectable_advertising_init();
                conn_params_init();
                // Start execution.
                NRF_LOG_INFO("Connected Advertising!");
                connect_advertising_start();
        }
        else
        {
                gap_params_init();
                non_connectable_advertising_init();
                NRF_LOG_INFO("Non-Connected Advertising!");
                non_connect_advertising_start();

        }
        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
